app/Controllers/Admisiones/AdmisionController.php

SELECT *
FROM `t_paciente`
WHERE `pac_cedula` = '100197880'
 LIMIT 1
---

        // 2. Buscar por cédula si es válida
        if (empty($paciente) && !empty($cedula) && $cedula !== 'N/A' && !str_contains($cedula, 'N/A-')) {
            $paciente = $pacienteModel->where('pac_cedula', $cedula)->first();

SELECT *
FROM `t_provincia`
WHERE `t_provincia`.`prov_codigo` = '15'
SELECT *
FROM `t_canton`
WHERE `t_canton`.`cant_codigo` = '1509'
SELECT *
FROM `t_parroquia`
WHERE `t_parroquia`.`parr_codigo` = '150950'
---
    private function construirLugarNacimiento($provCodigo, $cantCodigo, $parrCodigo)
    {
        if (empty($provCodigo)) {
            return null;
        }

        $provinciaModel = new \App\Models\Admision\GuardarSecciones\ProvinciaModel();
        $cantonModel = new \App\Models\Admision\GuardarSecciones\CantonModel();
        $parroquiaModel = new \App\Models\Admision\GuardarSecciones\ParroquiaModel();

        $provincia = $provinciaModel->find($provCodigo);
        $canton = !empty($cantCodigo) ? $cantonModel->find($cantCodigo) : null;

        // Buscar parroquia en ambas tablas (rural y urbana)
        $parroquia = null;
        if (!empty($parrCodigo)) {
            // Primero intentar buscar en parroquias rurales
            $parroquia = $parroquiaModel->find($parrCodigo);

UPDATE `t_paciente` SET `pac_cedula` = '100197880', `pac_apellidos` = 'ARMAS ARCINIEGAS', `pac_nombres` = 'XIMENA CATALINA', `pac_edad_valor` = '55', `pac_edad_unidad` = 'A', `pac_fecha_nac` = '1970-06-12', `pac_lugar_nac` = 'ECUADOR, NAPO, CARLOS JULIO AROSEMENA TOLA, CARLOS JULIO AROSEMENA TOLA', `prov_codigo` = '15', `cant_codigo` = '1509', `parr_codigo` = '150950', `pac_ocupacion` = '', `pac_telefono_fijo` = '2937826', `pac_telefono_celular` = '', `pac_provincias` = 'A ESPECIFICAR', `pac_cantones` = 'A ESPECIFICAR', `pac_parroquias` = 'A ESPECIFICAR', `pac_barrio` = '', `pac_direccion` = 'ROCAFUERTE Y MONTUFAR', `pac_calle_secundaria` = 'A ESPECIFICAR', `pac_referencia` = 'A ESPECIFICAR', `pac_avisar_a` = 'MIGUEL JARAMILLO', `pac_parentezco_avisar_a` = 'ESPOSO', `pac_direccion_avisar` = 'ROCAFUERTE Y MONTUFAR', `pac_telefono_avisar_a` = '2937826', `pac_grupo_prioritario` = 0, `pac_grupo_sanguineo` = 'A ESPECIFICAR', `gen_codigo` = '2', `esc_codigo` = '2', `emp_codigo` = '4', `nac_codigo` = '1', `gcu_codigo` = '7', `seg_codigo` = '5', `nedu_codigo` = NULL, `eneduc_codigo` = NULL, `tdoc_codigo` = NULL, `nac_ind_codigo` = NULL, `pue_ind_codigo` = NULL
WHERE `t_paciente`.`pac_codigo` IN ('15')
---
            'pue_ind_codigo' => $request->getPost('pac_pueblo_indigena'),
        ];

        $pacienteModel->update($pacienteId, $data);

INSERT INTO `t_atencion` (`ate_fecha`, `ate_hora`, `ate_referido`, `ate_motivo_policia`, `ate_otro_motivo`, `ate_fecha_evento`, `ate_lugar_evento`, `ate_direccion_evento`, `ate_custodia_policial`, `ate_observaciones`, `ate_colores`, `ate_aliento_etilico`, `ate_valor_alcolchek`, `ate_fuente_informacion`, `ate_ins_entrega_paciente`, `ate_telefono`, `lleg_codigo`, `pac_codigo`) VALUES ('2025-10-18', '14:47:38', 'NO', 'NO', 'NINGUNO', '2025-10-18', 'NO ESPECIFICADO', 'NO ESPECIFICADA', 'NO', NULL, NULL, 'NO', NULL, '', '', '', '1', '15')
---
        ];

        try {
            $resultado = $atencionModel->insert($dataAtencion);

INSERT INTO `t_establecimiento_registro` (`estab_codigo`, `ate_codigo`, `est_num_archivo`, `usu_id`) VALUES (1, 1, '00001', '2')
---
    private function guardarEstablecimientoRegistro($estabArchivo, $estabCodigo, $ateCodigo, $usuId)
    {
        $establecimientoRegistroModel = new EstablecimientoRegistroModel();

        // Datos a insertar en la tabla t_establecimiento_registro
        $data = [
            'estab_codigo' => $estabCodigo,
            'ate_codigo' => $ateCodigo,
            'est_num_archivo' => $estabArchivo,
            'usu_id' => $usuId
        ];

        // Guardar en la base de datos (ahora permite duplicados)
        if ($establecimientoRegistroModel->save($data)) {

SELECT *
FROM `t_establecimiento_registro`
ORDER BY `creado_en` DESC
 LIMIT 1
---
    public function generarNumeroArchivo()
    {
        $establecimientoRegistroModel = new EstablecimientoRegistroModel();

        // Obtener el último registro de archivo
        $ultimoRegistro = $establecimientoRegistroModel->orderBy('creado_en', 'DESC')->first();