app/Models/Admision/EstablecimientoRegistroModel.php

SELECT *
FROM `t_establecimiento_registro`
ORDER BY `creado_en` DESC
 LIMIT 1
---
    public function generarNumeroArchivo()
    {
        $ultimoRegistro = $this->orderBy('creado_en', 'DESC')->first();