app/Models/Admision/GuardarSecciones/ProvinciaModel.php

    public function obtenerTodasProvincias()
    {
        return $this->orderBy('prov_nombre', 'ASC')->findAll();
---
SELECT *
FROM `t_provincia`
ORDER BY `prov_nombre` ASC