app/Models/Administrador/UsuarioModel.php

SELECT COUNT(*) AS `numrows`
FROM `t_usuario`
WHERE `usu_usuario` = 'admision1'
AND `usu_estado` = 'activo'
---
    public function verificarUsuarioActivo($nombreUsuario)
    {
        return $this->where('usu_usuario', $nombreUsuario)
            ->where('usu_estado', 'activo')
            ->countAllResults() > 0;

SELECT `t_usuario`.*, `t_rol`.`rol_nombre`
FROM `t_usuario`
LEFT JOIN `t_rol` ON `t_rol`.`rol_id` = `t_usuario`.`rol_id`
WHERE `t_usuario`.`usu_usuario` = 'admision1'
AND `t_usuario`.`usu_estado` = 'activo'
 LIMIT 1
---
    public function getUsuarioConRolPorNombre($nombreUsuario)
    {
        return $this->select('t_usuario.*, t_rol.rol_nombre')
            ->join('t_rol', 't_rol.rol_id = t_usuario.rol_id', 'left')
            ->where('t_usuario.usu_usuario', $nombreUsuario)
            ->where('t_usuario.usu_estado', 'activo')
            ->first();