app/Controllers/Enfermeria/DatosEnfermeriaController.php

SELECT *
FROM `t_atencion`
WHERE `t_atencion`.`ate_codigo` = '1'
---
    private function cargarDatosFormulario($ate_codigo)
    {
        $data = [];
        $nombreCompleto = session()->get('usu_nombre') . ' ' . session()->get('usu_apellido');
        $data['nombre_admisionista'] = $nombreCompleto;
        $data['enfermeria_nombre'] = $nombreCompleto;

        try {
            $establecimientoModel = new EstablecimientoModel();
            $establecimiento = $establecimientoModel->obtenerEstablecimientoActual();

            $data['estab_institucion'] = $establecimiento['est_institucion'] ?? '';
            $data['estab_unicode'] = $establecimiento['est_unicodigo'] ?? '';
            $data['estab_nombre'] = $establecimiento['est_nombre_establecimiento'] ?? '';
        } catch (\Exception $e) {
            log_message('error', 'Error cargando datos del establecimiento: ' . $e->getMessage());
            $data['estab_institucion'] = '';
            $data['estab_unicode'] = '';
            $data['estab_nombre_establecimiento'] = '';
        }

        // Obtener los datos usando ate_codigo específico
        try {
            $pacienteModel = new PacienteModel();
            $atencionModel = new AtencionModel();

            // Obtener la atención específica
            $atencion = $atencionModel->find($ate_codigo);

SELECT *
FROM `t_paciente`
WHERE `t_paciente`.`pac_codigo` = '15'
---
            }

            // Obtener datos del paciente usando pac_codigo de la atención
            $paciente = $pacienteModel->find($atencion['pac_codigo']);

SELECT `t_establecimiento_registro`.*, `t_usuario`.`usu_nombre`, `t_usuario`.`usu_apellido`, `t_usuario`.`usu_usuario`
FROM `t_establecimiento_registro`
JOIN `t_usuario` ON `t_establecimiento_registro`.`usu_id` = `t_usuario`.`usu_id`
WHERE `t_establecimiento_registro`.`ate_codigo` = '1'
 LIMIT 1
---
            $establecimientoRegistroModel = new EstablecimientoRegistroModel();

            // Buscar el registro de admisión con los datos del usuario que lo creó
            $registroAdmision = $establecimientoRegistroModel
                ->select('t_establecimiento_registro.*, t_usuario.usu_nombre, t_usuario.usu_apellido, t_usuario.usu_usuario')
                ->join('t_usuario', 't_establecimiento_registro.usu_id = t_usuario.usu_id')
                ->where('t_establecimiento_registro.ate_codigo', $atencion['ate_codigo'])
                ->first();