app/Models/Enfemeria/ListaEnfermeriaModel.php

SELECT `t_paciente`.`pac_codigo`, `t_paciente`.`pac_nombres`, `t_paciente`.`pac_apellidos`, `t_paciente`.`pac_cedula`, `t_atencion`.`ate_fecha`, `t_atencion`.`ate_hora`, `t_atencion`.`ate_codigo`
FROM `t_atencion`
JOIN `t_paciente` ON `t_atencion`.`pac_codigo` = `t_paciente`.`pac_codigo`
LEFT JOIN `t_constantes_vitales` ON `t_atencion`.`ate_codigo` = `t_constantes_vitales`.`ate_codigo`
WHERE `t_constantes_vitales`.`con_codigo` IS NULL
ORDER BY `t_atencion`.`ate_codigo` ASC
---
    public function obtenerPacientesConAtencion()
    {
        return $this->select('
                t_paciente.pac_codigo,
                t_paciente.pac_nombres,
                t_paciente.pac_apellidos,
                t_paciente.pac_cedula,
                t_atencion.ate_fecha,
                t_atencion.ate_hora,
                t_atencion.ate_codigo
            ')
            ->join('t_paciente', 't_atencion.pac_codigo = t_paciente.pac_codigo')
            ->join('t_constantes_vitales', 't_atencion.ate_codigo = t_constantes_vitales.ate_codigo', 'left')
            ->where('t_constantes_vitales.con_codigo IS NULL') // SOLO atenciones SIN constantes vitales
            ->orderBy('t_atencion.ate_codigo', 'ASC') // Más reciente primero por ate_codigo
            ->findAll();